; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v6)
		(pred_6 ?v8)
		(pred_1 ?v7)
		(pred_4 ?v7)
		(pred_3 ?v8 ?v7)
		(pred_5)
		(pred_2 ?v8))

   (:action op_3
       :parameters  (?v3 ?v4)
       :precondition (and (not-eq ?v3 ?v4) 
                          (pred_1 ?v3) (pred_1 ?v4) (pred_4 ?v3))
       :effect (and  (pred_4 ?v4)
		     (not (pred_4 ?v3))))


   (:action op_1
       :parameters (?v1 ?v2)
       :precondition  (and  (pred_6 ?v1) (pred_1 ?v2)
			    (pred_3 ?v1 ?v2) (pred_4 ?v2) (pred_5))
       :effect (and (pred_2 ?v1)
		    (not (pred_3 ?v1 ?v2)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v1  ?v2)
       :precondition  (and  (pred_6 ?v1) (pred_1 ?v2)
			    (pred_2 ?v1) (pred_4 ?v2))
       :effect (and (pred_3 ?v1 ?v2)
		    (pred_5)
		    (not (pred_2 ?v1)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_03 obj_04 obj_05 
          obj_06 obj_01 obj_02 
)
(:init
(pred_1 obj_03)
(pred_1 obj_04)
(pred_1 obj_05)
(pred_6 obj_06)
(pred_6 obj_01)
(pred_6 obj_02)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(pred_5)
(pred_3 obj_06 obj_03)
(pred_3 obj_01 obj_04)
(pred_3 obj_02 obj_03)
(pred_4 obj_04)
)
(:goal
(and
(pred_3 obj_06 obj_05)
(pred_3 obj_01 obj_03)
(pred_3 obj_02 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_06 obj_05) (pred_4 obj_04))
    (sometime-before  (pred_3 obj_01 obj_03) (pred_4 obj_05))
    (sometime-before  (pred_3 obj_02 obj_05) (pred_4 obj_04))
  )
)
)

; plan
1. (op_3 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_03)
   goals met: 0 of 3
2. (op_1 obj_02 obj_03)
   deleted: (pred_3 obj_02 obj_03) (pred_5)
   added: (pred_2 obj_02)
   goals met: 0 of 3
3. (op_3 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_05)
   goals met: 0 of 3
4. (op_2 obj_02 obj_05)
   deleted: (pred_2 obj_02)
   added: (pred_3 obj_02 obj_05) (pred_5)
   goals met: 1 of 3
5. (op_3 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_03)
   goals met: 1 of 3
6. (op_1 obj_06 obj_03)
   deleted: (pred_3 obj_06 obj_03) (pred_5)
   added: (pred_2 obj_06)
   goals met: 1 of 3
7. (op_3 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_05)
   goals met: 1 of 3
8. (op_2 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_3 obj_06 obj_05) (pred_5)
   goals met: 2 of 3
9. (op_3 obj_05 obj_04)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_04)
   goals met: 2 of 3
10. (op_1 obj_01 obj_04)
   deleted: (pred_3 obj_01 obj_04) (pred_5)
   added: (pred_2 obj_01)
   goals met: 2 of 3
11. (op_3 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_03)
   goals met: 2 of 3
12. (op_2 obj_01 obj_03)
   deleted: (pred_2 obj_01)
   added: (pred_3 obj_01 obj_03) (pred_5)
   goals met: 3 of 3
